Repository: hexlet-codebattle/codebattle
Catalog: services/app/apps/codebattle/priv/gettext/*/LC_MESSAGES/default.po
Languages: ru

source: Welcome to %{name}!
ru: Добро пожаловать в %{name}

source: %{name}: game for programmers.
ru: %{name}: игра для программистов.

source: List of games
ru: Список игр

source: Lobby chat
ru: Общий чат

source: Type a message...
ru: Введите сообщение...

source: Online users
ru: Пользователи в сети

source: Logout
ru: Выход

source: Log in
ru: Войти

source: Name
ru: Имя

source: Password
ru: Пароль

source: Enter your name
ru: Введите ваше имя

source: Enter your password
ru: Введите ваш пароль

source: Sign in with %{name}
ru: Войти через %{name}

source: Listing games
ru: Список игр

source: Total:
ru: Общее количество:

source: Users rating:
ru: Рейтинг пользователей:

source: id: %{id}, state: %{state}, players: %{players}
ru: id: %{id}, состояние: %{state}, игроки: %{players}

source: Join
ru: Присоединиться

source: Show
ru: Наблюдать

source: Continue
ru: Продолжать

source: Main page
ru: Главная страница

source: Game: %{id}
ru: Игра: %{id}

source: State: %{state}
ru: Состояние: %{state}

source: The winner is: %{name}
ru: Победитель: %{name}

source: Players
ru: Игроки

source: Check result
ru: Проверить результат

source: Waiting for an opponent
ru: Ожидание соперника

source: You are following ID: %{followId}
ru: Вы подписаны на ID: %{followId}

source: Back to the list of games
ru: Вернуться к списку игр

source: Game chat
ru: Игровой чат

source: %{index}) name: %{name}, rating: %{rating}
ru: %{index}) имя: %{name}, рейтинг: %{rating}

source: You have been logged out!
ru: Вы успешно вышли из системы!

source: Welcome to Codebattle!
ru: Добро пожаловать в Codebattle!

source: Invalid name or password
ru: Неверное имя пользователя или пароль

source: Failed to authenticate.
ru: Ошибка аутентификации.

source: Successfully authenticated
ru: Успешная аутентификация.

source: Game not found
ru: Игра не найдена

source: Game has been created
ru: Игра успешно создана

source: Yay, you won the game!
ru: Ура, Вы победили!

source: You lost the game
ru: Вы проиграли игру.

source: Page not found
ru: Страница не найдена

source: Internal server error
ru: Внутренняя ошибка сервера

source: You must be logged in to access that page
ru: Для просмотра этой страницы Вам нужно войти

source: joined to
ru: Вошёл в

source: left
ru: Покинул

source: channel
ru: канал

source: Game over
ru: Игра окончена

source: Game status
ru: Статус игры

source: Join the game
ru: Вы подключились к игре

source: Sign Out
ru: Выйти

source: Sign up
ru: Регистрация

source: Successfully authenticated.
ru: Успешная аутентификация.

source: Users rating
ru: Рейтинг пользователей

source: You are in a different game
ru: Вы уже участвуете в другой игре

source: won the game!
ru: Вы победили в игре!

source: Hexlet
ru: Хекслет

source: My Profile
ru: Мой Профиль

source: Tasks
ru: Задачи

source: Tournaments
ru: Турниры

source: Tournament
ru: Турнир

source: Join Discord
ru: Чат Discord

source: Settings
ru: Настройки

source: Tg#codebattle
ru: Чат телеграмм

source: SourceCode
ru: Исходный Код

source: Pause
ru: Приостановить

source: Unpause
ru: Возобновить

source: Unfollow
ru: Прекратить

source: Task:
ru: Задача:

source: Won:
ru: Побед:

source: Lost:
ru: Поражений:

source: GaveUp:
ru: Сдался:

source: Task
ru: Задача

source: Editor
ru: Редактор

source: Output
ru: Тесты

source: Send
ru: Отправить

source: Notification
ru: Нотификация

source: Run
ru: Запустить

source: Charging...
ru: Заряжается...

source: Running...
ru: Запускается...

source: Show guide
ru: Гайд

source: Reset solution
ru: Сбросить решение

source: Check solution
ru: Проверить решение

source: Expand
ru: Развернуть описание

source: Found a mistake? Have something to add? Pull Requests are welcome:
ru: Нашли ошибку? Вам есть что добавить к описанию? Мы будем рады вашим Pull Requests:

source: Run your code!
ru: Запустите Ваш код!

source: Solution cannot be executed
ru: Решение не может быть выполнено

source: Tests failed
ru: Тесты не пройдены

source: You passed %{successCount} from %{assertsCount} asserts. (%{percent}%)
ru: Прошли %{successCount} из %{assertsCount} тестов. (%{percent}%)

source: Yay! All tests passed!!111
ru: Поздравляю! Все тесты пройдены!!111

source: Success Test Message
ru: Поздравляю! Тесты пройдены!

source: Failure Test Message
ru: О нет, тесты не пройдены!

source: Win Game Message
ru: Поздравляю! Вы победили!

source: Win Training Message
ru: Поздравляю! Если вы хотите сражаться с живыми игроками за место в рейтинге - зарегистрируйтесь!

source: Time is up. There are no winners in the game
ru: Время вышло. Никто не выиграл эту битву

source: Lose Game Message
ru: К сожалению, Ваш оппонент выиграл эту битву

source: Press Check solution or press Give up
ru: Нажмите 'Проверить решение' или 'Сдаться'

source: Give up
ru: Сдаться

source: Сheck
ru: Отправить решение

source: Сheck status:
ru: Статус проверки:

source: execution time: %{time} ms
ru: время выполнения: %{time} ms

source: Receive:
ru: Получено:

source: Expected:
ru: Ожидалось:

source: Arguments:
ru: Аргументы:

source: Sort by:
ru: Сортировать по:

source: Rank
ru: Ранг

source: Rating
ru: Рейтинг

source: Games played
ru: Сыгранные игры

source: Joined
ru: Дата регистрации

source: Codebattle Intro
ru: Прочтите описание простой задачи и решите её быстрее вашего оппонента в реальном времени. Регистрируйтесь и играйте с ботами, друзьями и другими игроками. Так же, Вы можете сражаться в турнирах.

source: Codebattle Intro Title
ru: Добро пожаловать в Codebattle. Продемонстрируй свои умения!

source: Start simple battle
ru: Начать простое сражение

source: Start battle
ru: Начать битву

source: Try again
ru: Начать заново

source: Back to Home
ru: На главную

source: Open History
ru: Смотреть историю

source: %{name} (bot)
ru: %{name} (бот)

source: %{name} (you)
ru: %{name} (вы)

source: Fight
ru: Сражаться

source: Oh no, the time is out! Both players lost ;(
ru: О нет, время вышло! Оба игрока проиграли ;(

source: Timeout - no timeout
ru: Таймер - нет таймера

source: Timeout 60 seconds
ru: Таймер на 60 секунд

source: Timeout 120 seconds
ru: Таймер на 120 секунд

source: Timeout 300 seconds
ru: Таймер на 300 секунд

source: Timeout 600 seconds
ru: Таймер на 600 секунд

source: Timeout 1200 seconds
ru: Таймер на 1200 секунд

source: Timeout 3600 seconds
ru: Таймер на 3600 секунд

source: Top-3
ru: Топ-3

source: Total number of teams %{count}
ru: Общее количество команд %{count}

source: Place
ru: Место

source: Score
ru: Балл

source: User
ru: Участник

source: Duration (sec)
ru: Время (сек)

source: Clan
ru: Клан

source: Count of solutions
ru: Количество успешных решений

source: Total time for solving task
ru: Общее время решения задачи

source: Task duration distribution
ru: Распределение по времени решения задачи (Количество решений/сек)

source: Show task description
ru: Показать описание задачи

source: %{percent}% (sec)
ru: %{percent}% (сек)

source: Fastest time to solve task (sec)
ru: Самое быстрое решение (сек)

source: Slowest time to solve task (sec)
ru: Самое медленное решение (сек)

source: Event rating
ru: Таблица Участников

source: Clans rating
ru: Рейтинг кланов

source: Players rating
ru: Рейтинг участников

source: Clan players rating
ru: Рейтинг участников клана

source: Clan players_count/registrations
ru: Участники/Регистрации

source: Clan players count
ru: Количество участников

source: Event stages
ru: Как устроен турнир

source: Stage %{name}
ru: Тур %{name}

source: Stage:
ru: Тур:

source: Games:
ru: Игры:

source: Stats:
ru: Статистика:

source: Games
ru: Игры

source: closed
ru: закрыт

source: active
ru: активно

source: soon
ru: скоро

source: Login
ru: Логин

source: Tournament description
ru: Описание тура

source: Open
ru: Открыть

source: Cancel
ru: Отменить

source: Close
ru: Закрыть

source: Leave
ru: Выйти

source: Teams
ru: Команды

source: Search opponent
ru: Поиск соперника

source: Back to tournament
ru: Назад в турнир

source: Back to tournaments
ru: На главную

source: Back to event
ru: Вернуться в ЛК

source: Star us on GitHub
ru: Поддержать нас на GitHub

source: Star us
ru: Поддержать нас

source: Restart searching
ru: Вернуться к поиску

source: Stop searching
ru: Приостановить

source: Go to active game
ru: К активной игре

source: arena_task_stats
ru: Осталась %{count} задача

source: Searching opponent
ru: Поиск соперника

source: Congrats! All tasks are solved
ru: Задачи закончились, поздравляем!

source: The tournament will start: %{duration}
ru: Тур начнется через: %{duration}

source: The tournament will start soon
ru: Тур скоро начнется

source: The tournament is canceled
ru: Игры тура отменены

source: The tournament is finished
ru: Игры тура завершились

source: Your opponent is waiting: %{name}
ru: Ваш следующий оппонент: %{name}

source: Next match will be opened. Show now?
ru: Баттл начался! Открыть сейчас?

source: review
ru: общее

source: matches
ru: история

source: Opponent
ru: Соперник

source: Opponent clan
ru: Клан соперника

source: Status
ru: Статус задачи

source: Open match
ru: Перейти к задаче

source: You banned
ru: Вы забанены

source: Active match
ru: Есть активная задача

source: Waiting
ru: Ожидание

source: Wait round starts
ru: Ожидайте начала матча

source: Waiting Participants
ru: Ожидаем участников

source: Active
ru: Активен

source: Round break
ru: Перерыв

source: Canceled
ru: Отменен

source: Finished
ru: Завершен

source: Loading
ru: Загружается

source: Round ends in
ru: Задача завершится через

source: Next round will start in
ru: Следующая задача начнется через

source: Draw
ru: Последняя задача в ничью

source: You lose
ru: Последняя задача проиграна

source: You win
ru: Последняя задача выиграна

source: Your place in tournament
ru: Твое место в турнире

source: Your place
ru: Твое место

source: Your score
ru: Твой балл

source: Your clan place
ru: Место твоего клана

source: Your clan score
ru: Балл твоего клана

source: Statistics
ru: Статистика

source: Wins
ru: Побед

source: Wins count
ru: Количество побед

source: Score/Total
ru: Количество баллов

source: Loses
ru: Поражений

source: Timeout
ru: Нет победителя

source: Show match
ru: Показать игру

source: Show match history
ru: Показать историю игры

source: Continue match
ru: Продолжить игру

source: History
ru: История

source: stored
ru: Сохранена

source: game_over
ru: Игра завершена

source: Loading...
ru: Загрузка...

source: Join the round
ru: Перейти в раунд

source: Timeout in: %{time}
ru: Завершится через: %{time}

source: Woohoo, you're Champion!!!!!
ru: Баттл официально затащен!

source: Loading next game
ru: Ожидайте следующую игру

source: Tournament is over
ru: Турнир завершен

source: Round is over, wait for the next round
ru: Задача решена, дождись следующую

source: If you read this you've lost the game
ru: Ты заслуживаешь победы, продолжай!

source: I'll be back
ru: Айл би бэк

source: GG
ru: Чемпион

source: STDOUT
ru: ВЫВОД

source: Next game
ru: Следующая задача

source: Award
ru: Награда

source: Total entries: %{totalEntries}
ru: Общее количество: %{totalEntries}

source: We could not verify your solution
ru: Мы не смогли проверить ваше решение

source: Please try to fix your code and submit it again
ru: Пожалуйста, исправьте ваш код и отправьте его снова

source: Note that your code may contain an infinite loop or complex calculations
ru: Обратите внимание, что ваш код может содержать бесконечный цикл или сложные вычисления

source: Rating Panel
ru: Рейтинг участников

source: Reports Panel
ru: Отчеты

source: Player Panel
ru: Панель участника

source: Top users by clan ranking
ru: Лучшие игроки в рейтинге кланов

source: Tasks ranking
ru: Рейтинг задач

source: Clans bubble distribution
ru: График распределения лучших кланов

source: Duration distribution and top users by task
ru: Статистика по задаче

source: Back
ru: Назад

source: Tournament is paused
ru: Игра этапа завершены

source: Connection lost, please reload the page
ru: Связь с сервером потеряна, перезагрузите страницу

source: Show full tournament table
ru: Показать полную турнирную таблицу

source: Type: %{type}
ru: Тип: %{type}

source: swiss
ru: Швейцарская система

source: individual
ru: Олимпийская система

source: arena
ru: Арена

source: Tournament waiting_participants
ru: Турнир скоро начнется

source: Tournament canceled
ru: Турнир отменен

source: Tournament active
ru: Турнир активен

source: Tournament finished
ru: Турнир завершен

source: Starts At
ru: Начало

source: Game playing
ru: Игра продолжается

source: Game waiting_opponent
ru: Ожидание соперника

source: Game state: timeout
ru: Статус: время истекло

source: Game state: canceled
ru: Статус: игра отменена

source: Game state: game_over
ru: Статус: игра окончена

source: Game state: initial
ru: Статус: игра создается

source: Game state: builder
ru: Статус: игра готовится к запуску

source: Game state: waiting_opponent
ru: Статус: ожидание соперника

source: Game state: playing
ru: Статус: игра идет

source: Level: elementary
ru: Уровень: элементарный

source: Level: easy
ru: Уровень: легкий

source: Level: medium
ru: Уровень: средний

source: Level: hard
ru: Уровень: сложный

source: Timeout: %{sec} seconds
ru: Время на задачу: %{sec} секунд

source: undefined
ru: не определено

source: won
ru: победа

source: lost
ru: поражение

source: gave_up
ru: сдался

source: timeout
ru: время вышло

source: Game between
ru: Игра между

source: Game level
ru: Уровень сложности

source: Play with
ru: Играть с

source: Try simple battle
ru: Попробовать простую игру

source: You don't have access to this game
ru: У вас нет доступа к этой игре

source: Total players
ru: Всего игроков

source: No players yet
ru: Игроков пока нет

source: Task Description
ru: Описание задачи

source: Win
ru: Победа

source: Lost
ru: Поражение

source: Participant Dashboard
ru: Личный кабинет участника

source: Category
ru: Категория

source: Overall Standing
ru: Место в общем зачёте

source: Category Standing
ru: Место в категории

source: Qualification
ru: Квалификация

source: Semifinal Entrance
ru: Выход в полуфинал

source: Semifinal
ru: Полуфинал

source: Final Entrance
ru: Выход в финал

source: Final
ru: Финал

source: Failed
ru: Не прошёл

source: Go to
ru: Перейти

source: Report
ru: Сообщить о нарушении

source: Ban
ru: Забанить

source: Place in total
ru: Место в общем зачете

source: Place in category
ru: Место в категории

source: Time spent
ru: Время на этап

source: You already passed this stage
ru: Вы уже прошли этот этап

source: Stage confirmation
ru: Подтверждение этапа

source: Passed
ru: Прошёл

source: Not passed
ru: Не прошёл

source: Ranking
ru: Рейтинг

source: Sended
ru: Отправлено

source: Wait reviling results
ru: Ожидайте результатов соревнования

source: Leaderboard
ru: Рейтинг
