Repository: hexlet-codebattle/codebattle
Catalog: services/app/apps/codebattle/priv/gettext/*/LC_MESSAGES/errors.po
Languages: ru

source: can't be blank
ru: не может быть пустым

source: has already been taken
ru: уже занято

source: is invalid
ru: является недействительным

source: has invalid format
ru: имеет неверный формат

source: has an invalid entry
ru: имеет недопустимую запись

source: is reserved
ru: зарезервировано

source: does not match confirmation
ru: не соответствует подтверждению

source: is still associated to this entry
ru: по-прежнему связано с этой записью

source: are still associated to this entry
ru: по-прежнему связаны с этой записью

source: should be %{count} character(s)
ru: должен иметь %{count} символ(ов)

source: should have %{count} item(s)
ru: должен иметь %{count} элемент(ов)

source: should be at least %{count} character(s)
ru: должен быть не менее %{count} символ(ов)

source: should have at least %{count} item(s)
ru: должен иметь не менее %{count} элемент(ов)

source: should be at most %{count} character(s)
ru: должен быть не более %{count} символ(ов)

source: should have at most %{count} item(s)
ru: должен быть не более %{count} элемент(ов)

source: must be less than %{number}
ru: должен быть меньше %{number}

source: must be greater than %{number}
ru: должен быть больше %{number}

source: must be less than or equal to %{number}
ru: должен быть меньше или равен %{number}

source: must be greater than or equal to %{number}
ru: должен быть больше или равен %{number}

source: must be equal to %{number}
ru: должен быть равен %{number}

source: You are already in game
ru: Вы уже подключены к игре

source: You are not player of this game
ru: Вы не являетесь участником этой игры

source: Game is already playing
ru: Игра уже началась

source: You cannot check result after win
ru: Вы не можете осуществить проверку после победы

source: Game is over
ru: Игра окончена
