Repository: hexlet-codebattle/codebattle
Catalog: priv/gettext/*/LC_MESSAGES/default.po
Languages: ru

source: Welcome to %{name}!
ru: Добро пожаловать в %{name}

source: %{name}: game for programmers.
ru: %{name}: игра для прораммистов.

source: Create game
ru: Создать игру

source: Game list
ru: Список игр

source: Lobby chat
ru: Общий чат

source: Online users
ru: Пользователи в сети

source: Logout
ru: Выход

source: Sign in with %{name}
ru: Войти через %{name}

source: Listing games
ru: Список игр

source: Total:
ru: Общее количество:

source: Main page
ru: Главная страница

source: id: %{id}, state: %{state}, players: %{players}
ru: id: %{id}, состояние: %{state}, игроки: %{players}

source: Join
ru: Подключиться

source: Game: %{id}
ru: Игра: %{id}

source: State: %{state}
ru: Состояние: %{state}

source: подключился
ru: вошёл в

source: left
ru: покинул

source: channel
ru: канал

source: Joined successfully
ru: Успешное подключение

source: Unable to join
ru: Невозможно подключиться
